{"transcription": " All I wanted to do was fix my email. I did not expect to have a minor existential crisis about how much the world is about to change. Normally this is the sort of talk that I'd have given onstage at some conference about the future of the web, but I'm in New Zealand right now and I also have this vague suspicion that those conferences might not be relevant for too much longer. I was lucky enough to live through the mass adoption of the internet. For anyone younger than about 25 watching this, you won't remember just how fast and how incredible that transformation was. And I was on the cutting edge of it, I was living it, I was one of the people who understood what was going on. Useful new technologies generally follow a sigmoid curve. You have a slow takeoff as the technology is invented and the major pain points get sorted out. And then you have this incredible explosion of growth as people find it useful and the technology gets better and better and better and better and loads of competitors end to the market and people find more and more and more and more and more real world practical uses for it. And there's this massive race to make you a better bigger things that people keep making more stuff with. And then you reach the limit of what's possible with that technology and the rate of progress flattens out again. Basically there's a reason very few people camp outside Apple stores for the new iPhone anymore. I remember Napster from back in 1999 and in hindsight I think Napster was the first big sign of just how many industries were going to be changed or completely destroyed by the internet. Not just the music industry but travel agents, video rental stores and cyclopedia shopping malls, big box stores, the postal service, journalists and the entire media industry. Napster wasn't the first sign but it was the first major one that millions of non-technical people were using by choice. The first one to get big mass media attention and legal problems. It was the first big popular disruption. The first warning shot. The first rumble of thunder off in the distance that said the storm was approaching that everything was about to change. I don't think many people realised that at the time and even if they did they couldn't have predicted the world that would follow. The world that I grew up in. The world that I've got really comfortable with the world of the web, of social media, of smartphones. This video you're watching now is a very early 2023 video and a very English speaking one. This is a record of a point in time and space and I might be wrong about this. I don't know where technology is going to go from here but I think that world, my world, the one I grew up in, is about to change radically. I think we're on a new sigmoid curb and I have no idea how far along that curve we are right now and I don't know if I want to change with it but I think I'll have to and all I was trying to do was fix my email. This is a really specific problem but it really annoyed me and I have to explain it for the rest of this to make sense so bear with me. Almost every email system has the idea of folders. You have one copy of an email and once you're done with it you file it in a folder like a piece of paper and a filing cabinet because that's the mid-20th century physical analogy that the inventors went with. But in 2004 Google launched Gmail which threw all that out in favour of labels. Email is just in one big pile you search to find stuff and you add labels to help you sort it. I hate labels because I like the analogy of folders that's what I started out with, that's what I was already using. I didn't want to change for no reason but everything else about Gmail was so much better than any of the alternatives at the time that I moved over to it a couple years later and I decided fine I will just treat labels like folders. I'll change my workflow as little as possible. Each thread gets one label that's like putting it into a folder which meant that when I backed up my emails which I do never trust having only one copy of something particularly if that copies up in the cloud but when I did that I could use a regular old school desktop email program like Microsoft Outlook to make that backup. You can use programs like that with Gmail accounts they talk to each other if they didn't stuff like the default mail app on iPhones wouldn't work and people would complain but those old school programs don't understand labels so Gmail just lies and says they're folders. Great that means my email program can talk to Gmail and request a copy of all those messages one folder at a time and then I know it's backed up every message. They're even stored in actual email folders like I wanted. It took 15 years for me to notice that that wasn't working properly. I was doing a routine backup last month I noticed that a thread in that email backup was missing several recent messages and that made me suspicious. The kind of discomfort that you get when you know something is wrong but you don't know what it is yet so I looked a little bit further and I realized loads of messages were missing my backup more than 100,000 of them over 15 years. They were still there in Gmail and the web but they haven't been lost. It's just they haven't been backed up and that's because it turns out in Gmail labels only attached to individual messages and not the full thread that is invisible to most people it's barely mentioned in the documentation and it's a really subtle annoying distinction if you send an email put a label on that thread get a reply and then just hit archive that reply doesn't get the label and as you go back and forth and add to that thread none of the other messages there get a label unless you're explicitly untagged and retagged the whole thread which means more than a hundred thousand unlabelled messages wanted my backup. Is this a really specific nerdy problem that only I'm annoyed about? Yes absolutely I'm one of the very few people in the world that it's going to affect loads of people don't sort a label or emails at all and most don't back them up but I needed to fix this. I needed my backup to work and I did not want to change my damn workflow but how on earth do I fix every email thread over 15 years without painstakingly clicking through all of them? I grew up fixing things with code so obviously that's where my brain went. Google has a service called Apps Script it means that anyone can write simple code to easily change and automate things in Gmail calendar docs youtube whatever it's a brilliant service I've no idea how it ever got made and it will inevitably one day be shut down with very little warning because that's just what Google does. But Apps Script meant that to fix this problem I could just spend an hour or so writing a bit of code and it's been a while since I've done that. First thing I do when I'm coding something that's simple like that is I write out what it's meant to do in plain English just the flow of logic so I can then use that as a guide so I wrote that down and I thought hang on it's not an AI thing that's meant to do this now. Yes this is a video partly about chat GPT but I promise I'm not going to go into the details there telling someone about your fascinating AI conversation it's like telling someone about your dreams they don't care it just sounds like a hallucinating nonsense but I've seen posts from people being freaked out about just how good chat GPT is and intellectually yeah I looked at it and I agreed with them it seemed surprisingly good but it is just a text transformer all it does is guess what the next word in the phrase is. I knew you would have been seeing some improvements in that lately I made a video two years ago about the sentences computers can't understand but humans can and at the end of that video I made a joke about how computers with language skills are 10 years away just as they have been for the last 40 years. I was wrong turns out that's pretty much solved now but chat GPT is still just a thing that predicts what the next word is going to be it produces generic milk toast output that's confidently wrong about a lot of things it's going to help spammers and maybe have a little bit of real world use right but I thought okay let's put my text description in tell it to translate this into this obscure google app script see what it does and it wrote the code for me in a few seconds and I felt this pit of the stomach existential horror and at that moment I couldn't explain why but I figured it out later it's just predicting the next word the code it gave back was a bit wrong but frankly my first attempt would have been a bit wrong so I asked it in plain English to fix a couple of the errors that had spotted and it did and that version was nearly right not quite though it used a really strange approach I tried to work out why it had done that and then I realized I could just ask and it told me in English why it had done that and it had made the same mistake I did with my backup because turns out Google's documentation is wrong google app script itself treats labels as attaching to threads not messages google wrote their own programming language wrong so I told chat GPT about the error and it fixed the script it bodged its way around google's bad documentation to build the thing I was actually asking for and I throw all the back and forths I didn't actually save much time but it was so much easier I never had to pour through documentation to find the exact specific magical incantation that I needed also my coding skills are years out of date that's one of the reasons I don't make computer science videos anymore the last time I learned a new thing in code was probably 2015 my old skills were good enough I didn't want to change my workflow I'm not sure if chat GPT is a better code than I am but it felt about equal it felt like watching while someone wrote code with me occasionally chime in and go and think you think you might have made a mistake there and sometimes I was the one who made a mistake at one point I realized I'd written the wrong thing in that first text description chat GPT had just been following my wrong instructions I know it's just a text model that predicts what word comes next but it didn't feel like it so at first I thought that pit of the stomach existential dread feeling was because my brain had gone that's a human or that's an alien intelligence or because I was starting to think well what if my brain is just a transformer system that's trying to predict what the next word is I'm sure I remember some old pop science article about how your brain's a prediction engine and surprise is just a fancy word for being wrong about what comes next but then the next day I gave chat GPT a more difficult problem one that required not just translating English to code but actually a little bit of a logical leap and it just confidently, completely failed in multiple obvious ways and that meant that I wasn't worried about it coming from my job not yet anyway it's sure no one's asked for that exact problem to be solved before the one about the labels and messages chat GPT wasn't just copying and pasting from somewhere there was arguably creativity involved but if I'm honest a lot of the programming I used to do was just copying and pasting bits from somewhere at some point every modern programmer searched on Google or Stack Overflow and adapted something that someone else wrote it's basically part of the job at this point I'm deliberately avoiding the argument about creativity AI art and copyright by the way I don't know how I feel about it and I don't know how the courts will resolve it if I hired a human artist or musician to create a painting or song in a more famous artist style that would be weird but it would be legal as long as they're not pretending to be the famous artist as long as the smaller artist is not trading on their name that's fine the style of most of my videos on this channel is just a slightly faster version of the TV shows I watch growing up that's what this intelligence was trained of and this video is basically in the style of every other video essayist on youtube it's just I tend to double the beat a bit more often if someone set up an AI to generate youtube videos or even youtube educational videos as a genre I think I'd be fine with that I don't think I have a problem with my work being a small part of a massive pool of training data but if someone started ripping off specifically my name and my work yeah I can see why artists are furious about that the British legal term for it is passing off I've said before please don't train models on what I make or frankly on anyone specific without their consent but okay I wasn't worried about being replaced and I wasn't worried that I was actually talking to some human equivalent alien artificial intelligence so why did I still have that feeling of dread artificial intelligence text transformers and diffusion models everything that we're currently seeing seems to be on that sigmoid curve of progress and I don't know what point on that curve we've got to if we're already most of the way up the curve then cool programmers and artists have brand new tools but they can't create something at a human level with them it's not going to take many jobs it's going to make people's work more efficient the same way that loads of inventions like Photoshop have done before if we're at the middle of that curve then wow we are going to get some really impressive new tools very soon that still needs some humans to work them maybe Siri and the Google Assistant are going to become the things that they were always promised to be but that feeling of dread came from the idea that chat GPT and the new AI art systems might be to my world what Napster was to the late 90s the herald the first big warning that this new technology the thing that was going to change everything was starting to actually change everything where huge numbers of people not just the nerds were actively using it and it didn't matter that Napster got sued out of existence because by then there was Morpheus and Groxter and Linewire and Kazar and then there was Spotify the old business model that idea that you bought a copy of music had been struck a mortal blow and no one noticed it for a while if you hear echoes of the Napster case the law suits against AI art programs so do I I was getting a haircut the other week and unprompted the barber started talking about chat GPT and how he'd actually used it to write a formal email but he couldn't be bothered to put together himself he wasn't a particularly technical person he wasn't a nerd like me but he used it easily the same way that someone who wanted to get a load of music for free would figure out Napster it's not about chat GPT not specifically it's about what it represents because if we're still at the start of the curve for AI if we're at the Napster point then everything is about to change just as fast and just as strangely as it did in the early 2000s perhaps beyond all recognition and this time I'm on the wrong end of it I'm like the music executive back in 99 it feels to me like something might have just gone very wrong for the now comfortable world that I grew up with and that I've settled down in that's where the dread came from the worry that suddenly I don't know what comes next no one does I've been complaining for years that it feels like nothing has really changed since smartphones came along and I think that maybe maybe I should have been careful what I wished for at some point I'll look back on this video and with hindsight I will easily be able to see where we were on the curve we all will part of me hopes that I am entirely wrong that in a few years I'll still be working like this the email thing is a metaphor of course it won't be email folders for you it might be something else something you're attached to maybe something minor or maybe the whole industry you work in but right now that feeling that creeping horror that dread it turns out that was the worry that after years of being fairly steady and comfortable my world is about to change and despite everything I will still want my email to be in folders and now an AI generated NordVPN ad today I want to talk about one of my favorite tools for staying connected while traveling or just browsing the internet it's called NordVPN and it's been a game changer for me with NordVPN I can access content from anywhere in the world no matter where I am whether I'm in a country with strict internet censorship or I want to access a website that blocks people from a particular country or just want to catch up on my favorite shows from back home NordVPN has got me covered some other amazing features of NordVPN include the ability to connect up to six devices simultaneously and 24-7 customer support whether I'm using the laptop tablet or phone NordVPN makes it easy to stay connected and secure so if you're looking for a VPN that can help you access content from around the world and keep you safe and secure online give NordVPN a try trust me you won't regret it to get the best deal by currently offering go to nordvpn.com slash tom scott or click the link in the description I am going to be out of the job soon"}